
  #### plan-nodes-20251127T183645.txt 📖: `success`
  <details><summary>Show Contents</summary>

  ```

  
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.tiles-test.module.talos-vm["tiles-test-cp"].proxmox_virtual_environment_vm.main has changed
  ~ resource "proxmox_virtual_environment_vm" "main" {
        id                                   = "7411"
        name                                 = "tiles-test-cp"
      ~ network_interface_names              = [
            # (23 unchanged elements hidden)
            "lxc80620a938fba",
          ~ "lxcaaf376879542" -> "lxc_health",
          ~ "lxc_health" -> "lxcee7d548bac01",
          ~ "lxcee7d548bac01" -> "lxcff852d96ba90",
        ]
        tags                                 = []
        # (32 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.k8s-test.cloudflare_dns_record.delegation[0] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = "ns-cloud-a1.googledomains.com."
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.k8s-test.cloudflare_dns_record.delegation[1] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = "ns-cloud-a2.googledomains.com."
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.k8s-test.cloudflare_dns_record.delegation[2] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = "ns-cloud-a3.googledomains.com."
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

  # module.k8s-test.cloudflare_dns_record.delegation[3] will be created
  + resource "cloudflare_dns_record" "delegation" {
      + comment             = "Managed by Terraform"
      + comment_modified_on = (known after apply)
      + content             = "ns-cloud-a4.googledomains.com."
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tiles-test"
      + proxiable           = (known after apply)
      + proxied             = false
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 300
      + type                = "NS"
      + zone_id             = "73b4d912118a49df40acea58c4983678"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

  ```

  </details>
  
  